Documents/РаспределениеФ2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РаспределениеФ2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ДвиженияДенегДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиратьТабельПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьНаправлениеПоТабелю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ВедомостьВКассу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВКассу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Необновлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Начисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Расхождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_РасхождениеОбщееДДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникКазна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_СотрудникиКазна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСотрудникаКазна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоРаспределение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>А_РасхождениеРаспределение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>А_РасхождениеДДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникКазна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_СотрудникиКазна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>А_ДвижениеДДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникКазна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_СотрудникиКазна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/А_ДвиженияДенегДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ДвиженияДенегДоходыРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>А_ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУЭквайера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеДокументы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспределениеФ2/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения денег (зеркало БДДС Казны) по табличной части А_ДвижениеДДС.
	// Ф2 = наличная выплата ЗП. См. docs/superpowers/plans/2026-06-03-dvizheniya-dds-kazna-plan.md
	Движения.А_ДвиженияДенегДоходыРасходы.Записывать = Истина;
	Движения.А_ДвиженияДенегДоходыРасходы.Очистить();

	УпрОрг    = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	БанкКасса = _ДДС_ОпределитьКассуФ2();

	Для Каждого Стр Из А_ДвижениеДДС Цикл
		// Пустую СтатьюДДС НЕ пропускаем — полное зеркало Казны (часть строк РаспределениеКазна без статьи).
		Если Стр.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = Движения.А_ДвиженияДенегДоходыРасходы.Добавить();
		Запись.Период                        = Дата;
		Запись.БанковскийСчетКасса           = БанкКасса;
		Запись.Организация                   = УпрОрг;
		Запись.А_ОрганизацияБухгалтерия      = Справочники.Организации.ПустаяСсылка();
		Запись.ТипДенежныхСредств            = Перечисления.ТипыДенежныхСредств.Наличные;
		Запись.СтатьяДвиженияДенежныхСредств = Стр.СтатьяДвиженияДенежныхСредств;
		Запись.Подразделение                 = Стр.Подразделение;
		Запись.Сумма                         = Стр.Сумма;
	КонецЦикла;

КонецПроцедуры

// Касса из связанной ведомости в кассу (Ф2 — наличные).
Функция _ДДС_ОпределитьКассуФ2()
	Если ЗначениеЗаполнено(А_ВедомостьВКассу) И ЗначениеЗаполнено(А_ВедомостьВКассу.Касса) Тогда
		Возврат А_ВедомостьВКассу.Касса;
	КонецЕсли;
	Возврат Справочники.Кассы.ПустаяСсылка();   // fallback (ведомость не создана)
КонецФункции

Процедура ПриЗаписи(Отказ)

	// Защита от рекурсии при импорте через ConvertERP или при записи обратной ссылки
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Создание ВКассу больше НЕ делается из РаспределениеФ2 (2026-05-28).
	// Источник истины — А_ОтражениеЗПпоКазне (там есть СтатьяДДС из БДДС Казны,
	// исправленное Подразделение и все аналитики). См. процедуру
	// А_ОтражениеЗПпоКазне.СоздатьВедомостиВКассуПоОтражениюЗП().

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Организация = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	СуммаДокумента = Сотрудники.Итог("СуммаНачисления");

	// Контрольные суммы НЕ пересчитываем при загрузке через обмен (ConvertERP/Казна) и при
	// «флаговых» записях из подписки РКО (там ОбменДанными.Загрузка=Истина) — иначе затрём уже
	// посчитанные значения. Симметрично гарду в ПриЗаписи. При перепроведении из
	// А_ОтражениеЗПпоКазне.СоздатьДвиженияДДСПоОтражениюЗП() Загрузка=Ложь, поэтому суммы заполнятся.
	Если НЕ ОбменДанными.Загрузка Тогда
		_ЗаполнитьКонтрольныеСуммы();
	КонецЕсли;

КонецПроцедуры

// Заполняет контрольные колонки/флаги ТЧ Сотрудники и общие флаги шапки.
//   Сотрудники.СуммаПоРаспределение = Σ Распределение.СуммаНачисления по сотруднику;
//   Сотрудники.СуммаПоДДС           = Σ А_ДвижениеДДС.Сумма по сотруднику;
//   Сотрудники.А_РасхождениеРаспределение / А_РасхождениеДДС — построчно (по агрегату сотрудника);
//   А_Расхождение (шапка) — общий по РАСПРЕДЕЛЕНИЮ; А_РасхождениеОбщееДДС (шапка) — общий по ДДС.
// Сопоставление строго по ссылке Сотрудник (ИНН/КодСотрудникаКазна/СотрудникКазна не используются —
// пусты в 100% строк). «Битая» ссылка совпадает между Сотрудники и Распределение, поэтому
// СуммаПоРаспределение заполняется и у «дрейфующих» строк, а СуммаПоДДС у них = 0 (расхождение по ДДС).
// Колонки — «итог по сотруднику» в первой строке сотрудника (дубли/пустые → 0, без задвоения подвала).
// Флаги — агрегат ПО СОТРУДНИКУ (объединение ключей трёх ТЧ), пустой Сотрудник исключён.
Процедура _ЗаполнитьКонтрольныеСуммы()

	// Агрегаты по ТЧ-источникам, ключ — ссылка Сотрудник. Пустого Сотрудника пропускаем: сверка
	// идёт «по сотруднику», а пустые строки (в т.ч. by-design строки ДДС без статьи/сотрудника)
	// ни к какому сотруднику не относятся и не должны давать ложных расхождений.
	КартаРаспределение = Новый Соответствие;
	Для Каждого СтрР Из Распределение Цикл
		Если НЕ ЗначениеЗаполнено(СтрР.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		Накопл = КартаРаспределение[СтрР.Сотрудник];
		КартаРаспределение[СтрР.Сотрудник] = ?(Накопл = Неопределено, 0, Накопл) + СтрР.СуммаНачисления;
	КонецЦикла;

	КартаДДС = Новый Соответствие;
	Для Каждого СтрД Из А_ДвижениеДДС Цикл
		Если НЕ ЗначениеЗаполнено(СтрД.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		Накопл = КартаДДС[СтрД.Сотрудник];
		КартаДДС[СтрД.Сотрудник] = ?(Накопл = Неопределено, 0, Накопл) + СтрД.Сумма;
	КонецЦикла;

	КартаНачислено = Новый Соответствие;
	Для Каждого СтрС Из Сотрудники Цикл
		Если НЕ ЗначениеЗаполнено(СтрС.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		Накопл = КартаНачислено[СтрС.Сотрудник];
		КартаНачислено[СтрС.Сотрудник] = ?(Накопл = Неопределено, 0, Накопл) + СтрС.СуммаНачисления;
	КонецЦикла;

	ЕстьДвиженияДДС = (А_ДвижениеДДС.Количество() > 0);

	// Контрольные колонки + ПОСТРОЧНЫЕ флаги расхождения.
	// Колонки: «итог по сотруднику» кладём в ПЕРВУЮ строку сотрудника, в дублях/пустых — 0 (подвал не
	// задваивается). Построчные флаги — по АГРЕГАТУ сотрудника (а не голой строки), поэтому сводящиеся
	// дубли строк по одному сотруднику флага НЕ дают.
	Заполненные = Новый Соответствие;
	Для Каждого СтрС Из Сотрудники Цикл
		Если НЕ ЗначениеЗаполнено(СтрС.Сотрудник) Тогда
			СтрС.СуммаПоРаспределение = 0;
			СтрС.СуммаПоДДС = 0;
			СтрС.А_РасхождениеРаспределение = Ложь;
			СтрС.А_РасхождениеДДС = Ложь;
			Продолжить;
		КонецЕсли;

		ИтогНач = КартаНачислено[СтрС.Сотрудник];
		ИтогНач = ?(ИтогНач = Неопределено, 0, ИтогНач);
		ИтогРасп = КартаРаспределение[СтрС.Сотрудник];
		ИтогРасп = ?(ИтогРасп = Неопределено, 0, ИтогРасп);
		ИтогДДС = КартаДДС[СтрС.Сотрудник];
		ИтогДДС = ?(ИтогДДС = Неопределено, 0, ИтогДДС);

		СтрС.А_РасхождениеРаспределение = (Окр(ИтогНач - ИтогРасп, 2) <> 0);
		СтрС.А_РасхождениеДДС = (ЕстьДвиженияДДС И Окр(ИтогНач - ИтогДДС, 2) <> 0);

		Если Заполненные[СтрС.Сотрудник] = Неопределено Тогда
			Заполненные[СтрС.Сотрудник] = Истина;
			СтрС.СуммаПоРаспределение = ИтогРасп;
			СтрС.СуммаПоДДС = ИтогДДС;
		Иначе
			СтрС.СуммаПоРаспределение = 0;
			СтрС.СуммаПоДДС = 0;
		КонецЕсли;
	КонецЦикла;

	// ОБЩИЕ флаги шапки — на уровне сотрудника (объединение ключей трёх ТЧ, ловит и orphan-источник):
	//   А_Расхождение        — есть сотрудник с расхождением по РАСПРЕДЕЛЕНИЮ;
	//   А_РасхождениеОбщееДДС — есть сотрудник с расхождением по ДДС (при наличии движений ДДС).
	ВсеСотрудники = Новый Соответствие;
	Для Каждого КЗ Из КартаНачислено Цикл
		ВсеСотрудники[КЗ.Ключ] = Истина;
	КонецЦикла;
	Для Каждого КЗ Из КартаРаспределение Цикл
		ВсеСотрудники[КЗ.Ключ] = Истина;
	КонецЦикла;
	Для Каждого КЗ Из КартаДДС Цикл
		ВсеСотрудники[КЗ.Ключ] = Истина;
	КонецЦикла;

	РасхРаспределение = Ложь;
	РасхДДС = Ложь;
	Для Каждого КЗ Из ВсеСотрудники Цикл
		Сотр = КЗ.Ключ;
		ИтогНач = КартаНачислено[Сотр];
		ИтогНач = ?(ИтогНач = Неопределено, 0, ИтогНач);
		ИтогРасп = КартаРаспределение[Сотр];
		ИтогРасп = ?(ИтогРасп = Неопределено, 0, ИтогРасп);
		ИтогДДС = КартаДДС[Сотр];
		ИтогДДС = ?(ИтогДДС = Неопределено, 0, ИтогДДС);

		Если Окр(ИтогНач - ИтогРасп, 2) <> 0 Тогда
			РасхРаспределение = Истина;
		КонецЕсли;
		Если ЕстьДвиженияДДС И Окр(ИтогНач - ИтогДДС, 2) <> 0 Тогда
			РасхДДС = Истина;
		КонецЕсли;
	КонецЦикла;

	А_Расхождение = РасхРаспределение;
	А_РасхождениеОбщееДДС = РасхДДС;

КонецПроцедуры
